#include <stdio.h>
#define N 7

int main(void)
{
	int A[N] = {1, 32, 90, 13, 52, 9, 10};
	int i;
	/*
		Έχω τη μεταβλητή i που συμβολίζει τις θέσεις του πίνακα.
			Στην προκειμένη περίπτωση, αυτές οι θέσεις είναι 0, 1, 2, ..., 6
		
		Αυτό που θα ήθελα να κάνω στο for είναι να συγκρίνω το 52 με την τιμή του πίνακα
		στις θέσεις 0 έως 6.
		
		Το πρόβλημα ήταν ότι φτιάξαμε μία μεταβλητή number η οποία μέσα της είχε μία τυχαία τιμή
		(η οποία κατά πάσα πιθανότητα ήταν διάφορη του 52) και ουσιαστικά συγκρίναμε 7 φορές
		αυτή την τυχαία τιμή με το 52. Και τις 7 φορές έδειξε ότι δεν ίσχυε η ισότητα και για 
		αυτό δεν τυπώθηκε ποτέ τίποτα.
		
		Με τη συνθήκη Α[i]==52 ελέγχω αν το στοιχείο του πίνακα Α στη θέση i έχει την τιμή 52.
		Το i θα πάρει διαδοχικά τιμές από το 0 μέχρι το 6, άρα θα γίνουν διαδοχικοί έλεγχοι
		1η επανάληψη: Α[0] == 52 	=> 1 == 52 	=> false
		2η επανάληψη: Α[1] == 52 	=> 32 == 52 => false
		3η επανάληψη: Α[2] == 52	=> 90 == 52	=> false
		4η επανάληψη: Α[3] == 52	=> 13 == 52	=> false
		5η επανάληψη: Α[4] == 52	=> 52 == 52 => true -> Τυπώνουμε 4
		6η επανάληψη: Α[5] == 52	=> 9 == 52 	=> false
		7η επανάληψη: Α[6] == 52	=> 10 == 52 => false
	
		Το πλήθος των ελέγχων για πλήθος Ν στοιχείων θα είναι στη γενική περίπτωση Ν.
		Αυτό μπορούμε να πούμε ότι έχει χρονική πολυπλοκότητα Ο(Ν).
	*/
	
	for (i=0; i<N; i++)
	{
		if (A[i] == 52)
		{
			printf("%d\n", i);
		}
	}
	
	
	return 0;
}
